from django.db import models
from django.contrib.auth.models import User


# Create your models here.

class Register(models.Model):
    TITLE = (
        ('นาย/Mr.','นาย/Mr'),
        ('นาง/Mrs.', 'นาง/Mrs'),
        ('นางสาว/Ms.', 'นางสาว/Ms'),
    )

    PROVINCE_CHOICES = (
        ("กรุงเทพมหานคร", "กรุงเทพมหานคร"),
        ("กระบี่", "กระบี่"),
        ("กาญจนบุรี", "กาญจนบุรี"),
        ("กาฬสินธุ์", "กาฬสินธุ์"),
        ("กำแพงเพชร", "กำแพงเพชร"),
        ("ขอนแก่น", "ขอนแก่น"),
        ("จันทบุรี", "จันทบุรี"),
        ("ฉะเชิงเทรา", "ฉะเชิงเทรา"),
        ("ชัยนาท", "ชัยนาท"),
        ("ชัยภูมิ", "ชัยภูมิ"),
        ("ชุมพร", "ชุมพร"),
        ("ชลบุรี", "ชลบุรี"),
        ("เชียงใหม่", "เชียงใหม่"),
        ("เชียงราย", "เชียงราย"),
        ("ตรัง", "ตรัง"),
        ("ตราด", "ตราด"),
        ("ตาก", "ตาก"),
        ("นครนายก", "นครนายก"),
        ("นครปฐม", "นครปฐม"),
        ("นครพนม", "นครพนม"),
        ("นครราชสีมา", "นครราชสีมา"),
        ("นครศรีธรรมราช", "นครศรีธรรมราช"),
        ("นครสวรรค์", "นครสวรรค์"),
        ("นราธิวาส", "นราธิวาส"),
        ("น่าน", "น่าน"),
        ("นนทบุรี", "นนทบุรี"),
        ("บึงกาฬ", "บึงกาฬ"),
        ("บุรีรัมย์", "บุรีรัมย์"),
        ("ประจวบคีรีขันธ์", "ประจวบคีรีขันธ์"),
        ("ปทุมธานี", "ปทุมธานี"),
        ("ปราจีนบุรี", "ปราจีนบุรี"),
        ("ปัตตานี", "ปัตตานี"),
        ("พะเยา", "พะเยา"),
        ("พระนครศรีอยุธยา", "พระนครศรีอยุธยา"),
        ("พังงา", "พังงา"),
        ("พิจิตร", "พิจิตร"),
        ("พิษณุโลก", "พิษณุโลก"),
        ("เพชรบุรี", "เพชรบุรี"),
        ("เพชรบูรณ์", "เพชรบูรณ์"),
        ("แพร่", "แพร่"),
        ("พัทลุง", "พัทลุง"),
        ("ภูเก็ต", "ภูเก็ต"),
        ("มหาสารคาม", "มหาสารคาม"),
        ("มุกดาหาร", "มุกดาหาร"),
        ("แม่ฮ่องสอน", "แม่ฮ่องสอน"),
        ("ยโสธร", "ยโสธร"),
        ("ยะลา", "ยะลา"),
        ("ร้อยเอ็ด", "ร้อยเอ็ด"),
        ("ระนอง", "ระนอง"),
        ("ระยอง", "ระยอง"),
        ("ราชบุรี", "ราชบุรี"),
        ("ลพบุรี", "ลพบุรี"),
        ("ลำปาง", "ลำปาง"),
        ("ลำพูน", "ลำพูน"),
        ("เลย", "เลย"),
        ("ศรีสะเกษ", "ศรีสะเกษ"),
        ("สกลนคร", "สกลนคร"),
        ("สงขลา", "สงขลา"),
        ("สมุทรสาคร", "สมุทรสาคร"),
        ("สมุทรปราการ", "สมุทรปราการ"),
        ("สมุทรสงคราม", "สมุทรสงคราม"),
        ("สระแก้ว", "สระแก้ว"),
        ("สระบุรี", "สระบุรี"),
        ("สิงห์บุรี", "สิงห์บุรี"),
        ("สุโขทัย", "สุโขทัย"),
        ("สุพรรณบุรี", "สุพรรณบุรี"),
        ("สุราษฎร์ธานี", "สุราษฎร์ธานี"),
        ("สุรินทร์", "สุรินทร์"),
        ("สตูล", "สตูล"),
        ("หนองคาย", "หนองคาย"),
        ("หนองบัวลำภู", "หนองบัวลำภู"),
        ("อำนาจเจริญ", "อำนาจเจริญ"),
        ("อุดรธานี", "อุดรธานี"),
        ("อุตรดิตถ์", "อุตรดิตถ์"),
        ("อุทัยธานี", "อุทัยธานี"),
        ("อุบลราชธานี", "อุบลราชธานี"),
        ("อ่างทอง", "อ่างทอง"),
    )

    email = models.CharField(max_length=500,)
    title = models.CharField(max_length=500,choices=TITLE)
    first_name = models.CharField(max_length=500)
    last_name= models.CharField(max_length=500)
    birth_date = models.DateField()
    address_1 = models.CharField(max_length=500)
    city = models.CharField(max_length=100)
    province = models.CharField(max_length=100,choices=PROVINCE_CHOICES)
    postal_code = models.IntegerField()
    telephone_number = models.IntegerField()


class ModelRegister(models.Model):

    ROBOT_MODEL = (
        ("Mini-White","Mini-White"),
    )
    CHANNEL = (
        ("Facebook","Facebook"),
        ("Lazada","Lazada"),
        ("Website","Website"),
        ("สาขาใกล้บ้าน","สาขาใกล้บ้าน"),
        ("งานแสดงสินค้า","'งานแสดงสินค้า")
    )
    owner = models.ForeignKey(Register)
    purchase_date = models.DateField()
    robot_model = models.CharField(max_length=100,choices=ROBOT_MODEL)
    channel = models.CharField(max_length=200,choices=CHANNEL)
    recommendation = models.TextField(blank=True,null=True)











