from django.shortcuts import render,redirect
from ecosystem.forms import RegisterForm,ModelForm
from ecosystem.models import Register,ModelRegister

# Create your views here.

def home(request):
    register_form = RegisterForm()
    model_form=ModelForm()


    if request.method == "POST":
        register_form = RegisterForm(request.POST)
        model_form = ModelForm(request.POST)

        if register_form.is_valid() and model_form.is_valid():
            register = register_form.save(commit=False) and model_form.save(commit=False)
            register.save()

    return render(request,'home.html',{
        "register_form": register_form,
        "model_form":model_form
    })

def list(request):
    register = Register.objects.filter().order_by("-id")

    return render(request,'list.html',{'register':register})


"""
    ("กรุงเทพมหานคร","กรุงเทพมหานคร"),
    ("กระบี่","กระบี่"),
    ("กาญจนบุรี","กาญจนบุรี"),
    ("กาฬสินธุ์","กาฬสินธุ์"),
    ("กำแพงเพชร","กำแพงเพชร"),
    ("ขอนแก่น","ขอนแก่น"),
    ("จันทบุรี","จันทบุรี"),
    ("ฉะเชิงเทรา","ฉะเชิงเทรา"),
    ("ชัยนาท","ชัยนาท"),
    ("ชัยภูมิ","ชัยภูมิ"),
    ("ชุมพร","ชุมพร"),
    ("ชลบุรี","ชลบุรี"),
    ("เชียงใหม่","เชียงใหม่"),
    ("เชียงราย","เชียงราย"),
    ("ตรัง","ตรัง"),
    ("ตราด","ตราด"),
    ("ตาก","ตาก"),
    ("นครนายก","นครนายก"),
    ("นครปฐม","นครปฐม"),
    ("นครพนม","นครพนม"),
    ("นครราชสีมา","นครราชสีมา"),
    ("นครศรีธรรมราช","นครศรีธรรมราช"),
    ("นครสวรรค์","นครสวรรค์"),
    ("นราธิวาส","นราธิวาส"),
    ("น่าน","น่าน"),
    ("นนทบุรี","นนทบุรี"),
    ("บึงกาฬ","บึงกาฬ"),
    ("บุรีรัมย์","บุรีรัมย์"),
    ("ประจวบคีรีขันธ์","ประจวบคีรีขันธ์"),
    ("ปทุมธานี","ปทุมธานี"),
    ("ปราจีนบุรี","ปราจีนบุรี"),
    ("ปัตตานี","ปัตตานี"),
    ("พะเยา","พะเยา"),
    ("พระนครศรีอยุธยา","พระนครศรีอยุธยา"),
    ("พังงา","พังงา"),
    ("พิจิตร","พิจิตร"),
    ("พิษณุโลก","พิษณุโลก"),
    ("เพชรบุรี","เพชรบุรี"),
    ("เพชรบูรณ์","เพชรบูรณ์"),
    ("แพร่","แพร่"),
    ("พัทลุง","พัทลุง"),
    ("ภูเก็ต","ภูเก็ต"),
    ("มหาสารคาม","มหาสารคาม"),
    ("มุกดาหาร","มุกดาหาร"),
    ("แม่ฮ่องสอน","แม่ฮ่องสอน"),
    ("ยโสธร","ยโสธร"),
    ("ยะลา","ยะลา"),
    ("ร้อยเอ็ด","ร้อยเอ็ด"),
    ("ระนอง","ระนอง"),
    ("ระยอง","ระยอง"),
    ("ราชบุรี","ราชบุรี"),
    ("ลพบุรี","ลพบุรี"),
    ("ลำปาง","ลำปาง"),
    ("ลำพูน","ลำพูน"),
    ("เลย","เลย"),
    ("ศรีสะเกษ","ศรีสะเกษ"),
    ("สกลนคร","สกลนคร"),
    ("สงขลา","สงขลา"),
    ("สมุทรสาคร","สมุทรสาคร"),
    ("สมุทรปราการ","สมุทรปราการ"),
    ("สมุทรสงคราม","สมุทรสงคราม"),
    ("สระแก้ว","สระแก้ว"),
    ("สระบุรี","สระบุรี"),
    ("สิงห์บุรี","สิงห์บุรี"),
    ("สุโขทัย","สุโขทัย"),
    ("สุพรรณบุรี","สุพรรณบุรี"),
    ("สุราษฎร์ธานี","สุราษฎร์ธานี"),
    ("สุรินทร์","สุรินทร์"),
    ("สตูล","สตูล"),
    ("หนองคาย","หนองคาย"),
    ("หนองบัวลำภู","หนองบัวลำภู"),
    ("อำนาจเจริญ","อำนาจเจริญ"),
    ("อุดรธานี","อุดรธานี"),
    ("อุตรดิตถ์","อุตรดิตถ์"),
    ("อุทัยธานี","อุทัยธานี"),
    ("อุบลราชธานี","อุบลราชธานี"),
    ("อ่างทอง","อ่างทอง"),

"""